In [11]:
import pandas as pd
import numpy as np

## Handling Missing Value

In [12]:
new_df = pd.DataFrame({'col_a': [1,2,4,1, np.nan, np.nan, 5],
                       'col_b': [3,7, np.nan, 9, None, 5, 8],
                       'col_c': ['a', '?', 'x', 'y', '--', np.nan, 'r'],
                       'col_d': [True, True, np.nan, None, False, True, False]})

In [13]:
new_df

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0     ?   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    NaN    NaN    --  False
5    NaN    5.0   NaN   True
6    5.0    8.0     r  False

Dapat dilihat bahwa terdapat nilai kosong atau tak terdefinisi. np.nan, None, NaT (untuk data datetime) adalah standar pandas untuk missing values

### info : untuk melihat apakah ada missing values

In [14]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_a   5 non-null      float64
 1   col_b   5 non-null      float64
 2   col_c   6 non-null      object
 3   col_d   5 non-null      object
dtypes: float64(2), object(2)
memory usage: 352.0+ bytes

### isna/isnull : menampilkan nilai boolean

In [15]:
# Mengevaluasi tiap sel untuk missing values
new_df.isna()

   col_a  col_b  col_c  col_d
0  False  False  False  False
1  False  False  False  False
2  False   True  False   True
3  False  False  False   True
4   True   True  False  False
5   True  False   True  False
6  False  False  False  False

Dapat dilihat bahwa tanda seperti -, ? tidak terlacak sebagai missing values

#### + any : mengevaluasi per kolom

In [16]:
new_df.isna().any()

col_a    True
col_b    True
col_c    True
col_d    True
dtype: bool

#### + sum : mengevaluasi jumlah

In [17]:
new_df.isna().any().sum()

4

#### isnull == isna

In [18]:
new_df.isnull().sum()

col_a    2
col_b    2
col_c    1
col_d    2
dtype: int64

In [19]:
new_df.isna().sum()

col_a    2
col_b    2
col_c    1
col_d    2
dtype: int64

### Mendefinisikan Missing Values Tak Terdefinisi

In [20]:
## Simpan dulu data ke CSV
new_df.to_csv('data_missing.csv', index = False)

In [21]:

missing_value = ['?', '--', '||']
df0 = pd.read_csv('data_missing.csv', na_values = missing_value)
df0

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y    NaN
4    NaN    NaN   NaN  False
5    NaN    5.0   NaN   True
6    5.0    8.0     r  False

In [22]:
df0.isna()

   col_a  col_b  col_c  col_d
0  False  False  False  False
1  False  False   True  False
2  False   True  False   True
3  False  False  False   True
4   True   True   True  False
5   True  False   True  False
6  False  False  False  False

### Mengganti missing values tak terdefinisi

#### replace : mengganti data

In [23]:
df1 = new_df.replace({'?':np.nan, '--':np.nan})
df1

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    NaN    NaN   NaN  False
5    NaN    5.0   NaN   True
6    5.0    8.0     r  False

### Membuang Missing Values

#### dropna

In [24]:
# how = 'all' -> mendrop apabila semua baris berisi missing values
df1.dropna(axis=0, how='all', inplace=True)
df1

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    NaN    NaN   NaN  False
5    NaN    5.0   NaN   True
6    5.0    8.0     r  False

In [25]:
# inplace = True -> menggantikan DF awal
df1.dropna(axis=0, how='any')
df1

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    NaN    NaN   NaN  False
5    NaN    5.0   NaN   True
6    5.0    8.0     r  False

In [26]:
# how = 'any' -> mendrop apabila ada satu baris berisi missing values
df1.dropna(axis=0, how='any', inplace=True)
df1

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
6    5.0    8.0     r  False

In [27]:
df2 = new_df.replace({'?':np.nan, '--':np.nan})
df2

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    NaN    NaN   NaN  False
5    NaN    5.0   NaN   True
6    5.0    8.0     r  False

In [28]:
# Thresh -> menentukan batas missing values yang dierima
df2.dropna(axis=0, thresh=3)

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
3    1.0    9.0     y   None
6    5.0    8.0     r  False

### Mengganti Missing Values

Missing values dapat diganti dengan: 
1. Angka Nol 
2. Mean, Median, Modus

#### fillna : mengganti dengan Skalar

In [29]:
df2

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    NaN    NaN   NaN  False
5    NaN    5.0   NaN   True
6    5.0    8.0     r  False

In [30]:
# Mengganti missing values dengan nol
df2.fillna(0)

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0     0   True
2    4.0    0.0     x      0
3    1.0    9.0     y      0
4    0.0    0.0     0  False
5    0.0    5.0     0   True
6    5.0    8.0     r  False

In [31]:
# Mengganti missing values dengan mean
df2

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    NaN    NaN   NaN  False
5    NaN    5.0   NaN   True
6    5.0    8.0     r  False

In [34]:
df2.iloc[:, 0] = df2.iloc[:,0].fillna(df2.iloc[:,0].mean())
df2

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    2.6    NaN   NaN  False
5    2.6    5.0   NaN   True
6    5.0    8.0     r  False

In [35]:
# Mengganti missing values dengan modus
# Jangan lupa untuk menambahkan indeks 0 pada methode mode
df2['col_c'] = df2['col_c'].fillna(df2['col_c'].mode()[0])
df2

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0     a   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    2.6    NaN     a  False
5    2.6    5.0     a   True
6    5.0    8.0     r  False

#### + method : ffil

Mengisi missing values dengan nilai sebelumnya

In [37]:
df2.fillna(method = 'ffill', inplace=True)
df2

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0     a   True
2    4.0    7.0     x   True
3    1.0    9.0     y   True
4    2.6    9.0     a  False
5    2.6    5.0     a   True
6    5.0    8.0     r  False

#### + method: bfill

Mengisi missing values dengan nilai setelahnya

In [38]:
df3 = new_df.replace({'?':np.nan, '--':np.nan})
df3

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0   NaN   True
2    4.0    NaN     x    NaN
3    1.0    9.0     y   None
4    NaN    NaN   NaN  False
5    NaN    5.0   NaN   True
6    5.0    8.0     r  False

In [39]:
df3.fillna(method = 'bfill', inplace = True)
df3

   col_a  col_b col_c  col_d
0    1.0    3.0     a   True
1    2.0    7.0     x   True
2    4.0    9.0     x  False
3    1.0    9.0     y  False
4    5.0    5.0     r  False
5    5.0    5.0     r   True
6    5.0    8.0     r  False

## Excercise 7

1. Find how many missing values in each column of titanic data

In [65]:
data = pd.read_csv('datasets/train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [69]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

2. Replace missing vales with following values:

- Emberked with 'S'

In [70]:
data['Embarked'] = data['Embarked'].fillna('S')
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

- Age with mean

In [71]:
data['Age'] = data['Age'].fillna(data['Age'].mean())
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

- Cabin with mode

In [74]:
data['Cabin'] = data['Cabin'].fillna(data['Cabin'].mode()[0])
data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

CATATAN : Kalau pakai modus, jangan lupa pastikan indeksnya adalah nol